<?php

return [
    'individual'    => [
        '1'     => [
            'male'      => 'واحد',
            'female'    => 'واحدة',
        ],
        '2'     => [
            'male'      => [
                'grammar' => [
                    1   => 'إثنان',
                    2   => 'إثنين',
                ]
            ],
            'female'    => [
                'grammar'   => [
                    1   => 'إثنتان',
                    2   => 'إثنتين',
                ]
            ],
        ],
        '3'     => [
            'male'      => 'ثلاث',
            'female'    => 'ثلاثة',
        ],
        '4'     => [
            "male"      => 'أربع',
            "female"    => 'أربعة',
        ],
        '5'     => [
            "male"      => 'خمس',
            "female"    => 'خمسة',
        ],
        '6'     => [
            'male'      => 'ست',
            'female'    => 'ستة',
        ],
        '7'     => [
            'male'      => 'سبع',
            'female'    => 'سبعة',
        ],
        '8'     => [
            'male'      => 'ثماني',
            'female'    => 'ثمانية',
        ],
        '9'     => [
            'male'      => 'تسع',
            'female'    => 'تسعة',
        ],
        '10'    => [
            'male'      => 'عشر',
            'female'    => 'عشرة',
        ],
        '11'    => [
            'male'      => 'أحد عشر',
            'female'    => 'إحدى عشرة',
        ],
        '12'    => [
            "male"  => [
                'grammar' => [
                    1       => 'إثنا عشر',
                    2       => 'إثني عشر',
                ]
            ],
            "female" => [
                'grammar'   => [
                    1       => 'إثنتا عشرة',
                    2       => 'إثنتي عشرة',
                ]
            ],
        ],
        '13'    => [
            "male"      =>'ثلاث عشرة',
            "female"    =>'ثلاثة عشر',
        ],
        '14'    => [
            'male'      => 'أربع عشرة',
            'female'    => 'أربعة عشر',
        ],
        '15'    => [
            "male"      => 'خمس عشرة',
            "female"    => 'خمسة عشر',
        ],
        '16'    => [
            "male"      => 'ست عشرة',
            "female"    => 'ستة عشر',
        ],
        '17'    => [
            "male"      => 'سبع عشرة',
            "female"    => 'سبعة عشر',

        ],
        '18'    => [
            "male"      => 'ثماني عشرة',
            "female"    => 'ثمانية عشر',
        ],
        '19'    => [
            "male"      =>'تسع عشرة',
            "female"    =>'تسعة عشر',
        ],
        '20'    => [
            'grammar'   => [
                '1'     => 'عشرون',
                '2'     => 'عشرين',
            ],
        ],
        '30'    => [
            'grammar'   => [
                '1'     => 'ثلاثون',
                '2'     => 'ثلاثين',
            ],
        ],
        '40'    => [
            'grammar'   => [
                '1'     => 'أربعون',
                '2'     => 'أربعين',
            ],
        ],
        '50'    => [
            'grammar'   => [
                '1'     => 'خمسون',
                '2'     => 'خمسين',
            ],
        ],
        '60'    => [
            'grammar'   => [
                '1'     => 'ستون',
                '2'     => 'ستين',
            ],
        ],
        '70'    => [
            'grammar'   => [
                '1' => 'سبعون',
                '2' => 'سبعين',
            ],
        ],
        '80'    => [
            'grammar'   => [
                '1' => 'ثمانون',
                '2' => 'ثمانين',
            ],
        ],
        '90'    => [
            'grammar'   => [
                '1' => 'تسعون',
                '2' => 'تسعين',
            ],
        ],
        '100'   => 'مئة',
        '200'   => [
            'grammar'   => [
                '1' => 'مئتان',
                '2' => 'مئتين',
            ],
        ],
        '300'   => 'ثلاثمئة',
        '400'   => 'أربعمئة',
        '500'   => 'خمسمئة',
        '600'   => 'ستمئة',
        '700'   => 'سبعمئة',
        "800"   => 'ثمانمئة',
        "900"   => 'تسعمئة',
    ],

    'complications' => [ // scale => format
        1   => [
            1   => 'ألفان',
            2   => 'ألفين',
            3   => 'آلاف',
            4   => 'ألف',
        ],
        2   => [
            1   => 'مليونان',
            2   => 'مليونين',
            3   => 'ملايين',
            4   => 'مليون',
        ],
        3   => [
            1   => 'ملياران',
            2   => 'مليارين',
            3   => 'مليارات',
            4   => 'مليار',
        ],
        4   => [
            1   => 'تريليونان',
            2   => 'تريليونين',
            3   => 'تريليونات',
            4   => 'تريليون',
        ],
    ],

    'arabic-indic'  => [
        0   => '&#1632;',
        1   => '&#1633;',
        2   => '&#1634;',
        3   => '&#1635;',
        4   => '&#1636;',
        5   => '&#1637;',
        6   => '&#1638;',
        7   => '&#1639;',
        8   => '&#1640;',
        9   => '&#1641;',
    ],

    'ordering'      => [
        1   => [
            'male'      =>'حادي',
            'female'    =>'حادية',
        ],
        2   => [
            'male'      =>'ثاني',
            'female'    =>'ثانية',
        ],
        3   => [
            'male'      => 'ثالث',
            'female'    => 'ثالثة',
        ],
        4   => [
            'male'      => 'رابع',
            'female'    => 'رابعة',
        ],
        5   => [
            'male'      => 'خامس',
            'female'    => 'خامسة',
        ],
        6   => [
            'male'      => 'سادس',
            'female'    => 'سادسة',
        ],
        7   => [
            'male'      => 'سابع',
            'female'    => 'سابعة',
        ],
        8   => [
            'male'      =>'ثامن',
            'female'    =>'ثامنة',
        ],
        9   => [
            'male'      => 'تاسع',
            'female'    => 'تاسعة',
        ],
        10  => [
            'male'      => 'عاشر',
            'female'    => 'عاشرة',
        ],
    ],
];